Repository: dotteamdev/VictoriabankWoocommerce
Catalog: languages/victoriabank-payment-gateway-*.po
Languages: ro_ro, ru_ru

source: Public key
ro_ro: Cheie publică
ru_ru: Открытый ключ

source: Bank public key
ro_ro: Cheia publică a băncii
ru_ru: Открытый ключ банка

source: Private key
ro_ro: Cheie privată
ru_ru: Закрытый ключ

source: Private Key Password
ro_ro: Parolă cheie privată
ru_ru: Пароль секретного ключа

source: Encryption method
ro_ro: Metoda de criptare
ru_ru: Метод шифрования

source: Submit
ro_ro: Salvează
ru_ru: Сохранить

source: Manually process callback data
ro_ro: Procesează manual datele de apel invers
ru_ru: Вручную обрабатывать данные обратного вызова

source: Process
ro_ro: Procesează
ru_ru: Выполнить

source: Transaction "Sales completion" was made successfully
ro_ro: Tranzacția "Sales completion" a fost realizată cu succes
ru_ru: Транзакция "Sales completion" успешно проведена

source: Transaction "Refund" was made successfully
ro_ro: Tranzacția "Refund" a fost realizată cu succes
ru_ru: Транзакция "Refund" успешно проведена

source: Error:
ro_ro: Eroarea:
ru_ru: Ошибка:

source: Transaction failed
ro_ro: Tranzacția a eșuat
ru_ru: Транзакция не прошла

source: Transaction was made successfully, you can check result on the email
ro_ro: Tranzacția a fost efectuată cu succes, puteți verifica rezultatul pe e-mail
ru_ru: Транзакция прошла успешно, вы можете проверить результат по электронной почте

source: Merchant name
ro_ro: Numele comerciantului
ru_ru: Имя продавца

source: Merchant URL
ro_ro: Adresa URL a comerciantului
ru_ru: URL продавца

source: Merchant address
ro_ro: Adresa comerciantului
ru_ru: Адрес продавца

source: Return/refund policy URL
ro_ro: Adresa URL a politicii de returnare/rambursare
ru_ru: URL политики возврата/возврата

source: Customer service contact
ro_ro: Contact pentru serviciul clienți
ru_ru: Контакт связи со службой поддержки

source: Callback URL
ru_ru: URL-адрес обратного вызова

source: Logo for Visa/Mastercard
ro_ro: Sigla pentru Visa/Mastercard
ru_ru: Логотип для Visa/Mastercard

source: Logo for Star Card Rate
ro_ro: Sigla pentru Star Card Rate
ru_ru: Логотип для Star Card Rate

source: Logo for Puncte Star
ro_ro: Sigla pentru Puncte Star
ru_ru: Логотип для Puncte Star

source: WooCommerce Payment Gateway for Victoriabank Puncte Star
ro_ro: Poarta de plată WooCommerce pentru Victoriabank Puncte Star
ru_ru: Платёжный шлюз Woocommerce для Victoriabank Puncte Star

source: Activate/Deactivate
ro_ro: Activare/dezactivare
ru_ru: Активировать/деактивировать

source: Check box activate this payment method
ro_ro: Bifați caseta pentru a activa această metodă de plată
ru_ru: Флажок Активировать этот способ оплаты

source: Title
ro_ro: Titlu
ru_ru: Название

source: The title of the payment method shown to the customer during checkout
ro_ro: Titlul metodei de plată afișat clientului în timpul plății
ru_ru: Название способа оплаты, отображаемое покупателю при оформлении заказа

source: Description
ro_ro: Descriere
ru_ru: Описание

source: Description of the payment method displayed to the customer during checkout
ro_ro: Descrierea metodei de plată afișată clientului în timpul plății
ru_ru: Описание способа оплаты, показанное покупателю во время оформления заказа

source: Logo
ru_ru: Логотип

source: Logo of the payment method displayed to the customer during checkout
ro_ro: Sigla metodei de plată afișată clientului în timpul plății
ru_ru: Логотип способа оплаты, отображаемый покупателю во время оплаты

source: Terminal id
ro_ro: ID terminalului
ru_ru: ID терминала

source: This is id of payment terminal
ro_ro: Acesta este ID-ul terminalului de plată
ru_ru: Это идентификатор платежного терминала

source: Merchant id
ro_ro: ID comerciantului
ru_ru: ID продавца

source: This is id of merchant
ro_ro: Acesta este ID-ul comerciantului
ru_ru: Это идентификатор продавца

source: Test mode
ro_ro: Mod de testare
ru_ru: Тестовый режим

source: Enable Test Mode
ro_ro: Activează mod de testare
ru_ru: Активировать тестовый режим

source: Check box activate test mode
ro_ro: Caseta de bifare pentru a activa această opțiune
ru_ru: Флажок активирует тестовый режим

source: Debug mode
ro_ro: Mod de depanare
ru_ru: Режим отладки

source: Enable Debug Mode
ro_ro: Activează mod de depanare
ru_ru: Активировать режим отладки

source: Check box activate debug mode
ro_ro: Caseta de bifare pentru a activa mod de depanare
ru_ru: Флажок активирует режим отладки

source: Transaction type
ro_ro: Tipul tranzacției
ru_ru: Тип транзакции

source: Authorization
ro_ro: Autorizarea
ru_ru: Авторизация

source: Charge
ro_ro: Taxa
ru_ru: Плата немедленно

source: Selects how payments will be processed. Charge immediately sends all transactions to the bank for settlement, Authorization only authorizes the order amount to the bank for later settlement.
ro_ro: Selectează modul în care vor fi procesate plățile. Taxa trimite imediat toate tranzacțiile către bancă pentru decontare, Autorizarea autorizează doar suma comenzii către bancă pentru decontare ulterioară.
ru_ru: Выбирает, как будут обрабатываться платежи. Плата немедленно отправляет все транзакции в банк для расчета, Авторизация только авторизует сумму заказа в банк для последующего расчета.

source: Order description
ro_ro: Descrierea comenzii
ru_ru: Описание заказа

source: Description of the order shown to the customer on the bank's page during payment
ro_ro: Descrierea comenzii afișată clientului pe pagina băncii în timpul plății
ru_ru: Описание заказа, отображаемое покупателю на странице банка при оплате

source: WooCommerce Payment Gateway for Victoriabank Star Card Rate
ro_ro: Poarta de plată WooCommerce pentru Victoriabank Star Card Rate
ru_ru: Платёжный шлюз Woocommerce для Victoriabank Star Card Rate

source: Pay 2 installments
ro_ro: Plata in 2 rate
ru_ru: Оплата в 2 платежа

source: Pay 3 installments
ro_ro: Plata in 3 rate
ru_ru: Оплата в 3 платежа

source: Pay 6 installments
ro_ro: Plata in 6 rate
ru_ru: Оплата в 6 платежей

source: Pay 9 installments
ro_ro: Plata in 9 rate
ru_ru: Оплата в 9 платежей

source: Pay 12 installments
ro_ro: Plata in 12 rate
ru_ru: Оплата в 12 платежей

source: WooCommerce Payment Gateway for Victoriabank Visa/MasterCard
ro_ro: Poarta de plată WooCommerce pentru Victoriabank Visa/MasterCard
ru_ru: Платёжный шлюз Woocommerce для Victoriabank Visa/MasterCard

source: Activity Log
ro_ro: Jurnalul de activitate
ru_ru: Журнал активности

source: Activity
ro_ro: Activitate
ru_ru: Действие

source: Timestamp
ro_ro: Timestamp-ul
ru_ru: Время происходящего

source: No log data for this payment type
ro_ro: Nu există date de jurnal pentru acest tip de plată
ru_ru: Нет данных журнала для этого типа платежа

source: Previous
ro_ro: Precedent
ru_ru: Предыдущая

source: Next
ro_ro: Următor
ru_ru: Следующая

source: Order created: #
ro_ro: Comanda creată: #
ru_ru: Заказ создан: #

source: Order added amount:
ro_ro: Suma adăugată la comandă:
ru_ru: Добавленная сумма заказа:

source: Order added billing name:
ro_ro: Numele de facturare adăugat la comandă:
ru_ru: В заказ добавлено платежное имя:

source: Order added billing address:
ro_ro: Adresa de facturare adăugată la comandă:
ru_ru: В заказе добавлен платежный адрес:

source: Order added billing postcode:
ro_ro: Cod poștal de facturare adăugat la comanda:
ru_ru: Заказ добавил почтовый индекс для выставления счетов:

source: Order added billing phone:
ro_ro: Telefon de facturare adăugat pentru comandă:
ru_ru: В заказе добавлен телефон для выставления счетов:

source: Order added billing email:
ro_ro: E-mail de facturare adăugat pentru comandă:
ru_ru: Заказ добавил адрес электронной почты для выставления счетов:

source: Payment completed
ro_ro: Plata finalizată
ru_ru: Платеж завершен

source: Thank you for purchase our product!!!
ro_ro: Vă mulțumim pentru achiziționarea produsului nostru!!!
ru_ru: Спасибо за покупку нашего товара!!!

source: Unsuccessful payment
ro_ro: Plată nereușită
ru_ru: Неуспешная оплата

source: Your payment failed. Please try again or contact our support team if the problem continues to occur.
ro_ro: Plata dvs. a eșuat. Vă rugăm să încercați din nou sau să contactați echipa noastră de asistență dacă problema continuă să apară.
ru_ru: Ваш платеж не прошел. Пожалуйста, попробуйте еще раз или свяжитесь с нашей службой поддержки, если проблема не исчезнет.

source: You can return to
ro_ro: Te poți întoarce la
ru_ru: Вы можете вернуться к

source: Homepage
ro_ro: Pagina principala
ru_ru: Главная страница

source: and continue shopping.
ro_ro: și continuați cumpărăturile.
ru_ru: и продолжить покупки.

source: Unsuccessful payment page
ro_ro: Pagina de plată nereușită
ru_ru: Страница неуспешной оплаты

source: Settings
ro_ro: Setări
ru_ru: Настройки

source: Victoriabank payments settings
ro_ro: Setări de plăți Victoriabank
ru_ru: Victoriabank настройка платежей

source: VB payments settings
ro_ro: Setări de plăți VB
ru_ru: VB настройка платежей

source: Merchant data
ro_ro: Date comerciant-ului
ru_ru: Данные продавца

source: Connection settings
ro_ro: Setări de conectare
ru_ru: Настройки соединения

source: Notification settings
ro_ro: Setări de notificare
ru_ru: Настройка уведомлений

source: Notification of payments
ro_ro: Notificarea plăților
ru_ru: Уведомление о платежах

source: Payment settings
ro_ro: Setările plăților
ru_ru: Настройки платежей

source: Transaction "
ro_ro: Tranzacție "
ru_ru: Транзакция "

source: " was made successfully
ro_ro: " a fost realizat cu succes
ru_ru: " была выполнена успешно

source: " wasn't finalized successfully
ro_ro: " a fost realizat cu succes
ru_ru: " не была завершена успешно

source: Response code value :
ro_ro: Valoarea codului de răspuns:
ru_ru: Значение кода ответа:

source: Action status :
ro_ro: Starea acțiunii:
ru_ru: Статус действия :

source: : New order #
ro_ro: : Comandă nouă #
ru_ru: : Новый заказ #

source: Date of transaction
ro_ro: Data tranzactiei
ru_ru: Дата транзакции

source: Retrieval Reference Number (RRN)
ro_ro: Numărul de referință pentru extragere (RRN)
ru_ru: Справочный номер поиска (RRN)

source: Authorization code
ro_ro: Cod de autorizare
ru_ru: Код авторизации

source: Card number
ro_ro: Numărul de card
ru_ru: Номер карты

source: Congratulations on the sale. You are welcome to
ro_ro: Felicitări pentru cumpărături. Sunteți binevenit la
ru_ru: Поздравляем с покупкой. Добро пожаловать в

source: )<br><br> If you aren't satisfied in good quality you can return it by this
ro_ro: )<br><br> Dacă nu sunteți mulțumit de calitatea produselor, îl puteți returna prin aceasta
ru_ru: )<br><br> Если вас не устраивает качество товара, вы можете вернуть его по этой

source: return/refund policy
ro_ro: politica de returnare/rambursare
ru_ru: политике возврата

source: .<br><br> Also if you need another help contact us - <b>
ro_ro: .<br><br> De asemenea, dacă aveți nevoie de alt ajutor, contactați-ne - <b>
ru_ru: .<br><br> Также, если вам нужна дополнительная помощь, свяжитесь с нами - <b>

source: <b>.<br><br> Process your orders on the go. <a href="https://woocommerce.com/mobile">Get the app</a>
ro_ro: <b>.<br><br> Procesați-vă comenzile din mers. <a href="https://woocommerce.com/mobile">Descărcați aplicația</a>
ru_ru: <b>.<br><br> Обрабатывайте заказы на ходу. <a href="https://woocommerce.com/mobile">Получить приложение</a>

source: Email was sent to customer
ro_ro: Email a fost transmis la cumpărător
ru_ru: Электронное письмо было отправлено покупателю на почту

source: Hi %s,
ro_ro: Salut %s,
ru_ru: Привет %s,

source: Your order on %s has been partially refunded. There are more details below for your reference:
ro_ro: Comanda dvs. de pe %s a fost rambursată parțial. Mai multe detalii mai jos pentru referință:
ru_ru: Ваш заказ на %s был частично возмещен. Более подробная информация приведена ниже для справки:

source: Your order on %s has been refunded. There are more details below for your reference:
ro_ro: Comanda dvs. de pe %s a fost rambursată. Mai multe detalii mai jos pentru referință:
ru_ru: Ваш заказ на %s был возвращен. Более подробная информация приведена ниже для справки:
